---
kind: method
id: M:Autodesk.Revit.DB.ParameterMapIterator.#ctor
source: html/d676edca-1366-eebb-ca3f-241e106c7786.htm
---
# Autodesk.Revit.DB.ParameterMapIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public ParameterMapIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.